import HeaderSeparator from "@/components/header-separator";
import SectionHeader from "@/components/section-header";
import * as Banners from "@/assets/banners"

export default function PartnerPage() {
  return (
    <div className="mt-16">
      <HeaderSeparator
        slug="អង្គភាពចំណុះ"
        title="អង្គភាពចំណុះ"
        description="ផ្តល់ព័ត៌មានថ្មីអំពីសកម្មភាពកីឡាប្រកួតការជ្រើសរើសកីឡាករនិងសេចក្តីជូនដំណឹងសំខាន់ៗពីស្ថាប័នកីឡាជាតិដើម្បីឲ្យសាធារណជនទាន់ដឹងព័ត៌មានទាន់ពេលវេលា។"
        image={Banners.subBanner1}
      />
      <SectionHeader title="អង្គភាពចំណុះទាំងអស់នៅក្នុងស្ថាប័ន" />
    </div>
  )
}