"use client";
import { useRouter } from "next/navigation";
import { Spacer, Button, Image } from "@heroui/react";
import * as Banners from "@/assets/banners"

import Typography from "@/components/ui/typography";
import ArticleCard from "@/components/article-card"
import SectionHeader from "@/components/section-header"

export default function ArticleDetailPage() {
  const router = useRouter()

  const articles = [
    {
      id: "1",
      date: "២៥ មករា ២០២៥",
      title:
        "ពិធីចុះហត្ថលេខាលើអនុស្សរណៈសហការរវាង Lee Dong Sup ប្រធានក្រុម",
      description:
        "Lee Dong Sup បានចូលរួមក្នុងពិធីចុះហត្ថលេខាលើអនុស្សរណៈសហការជាមួយភាគីពាក់ព័ន្ធ ដើម្បីអភិវឌ្ឍវិស័យកីឡា...",
      image: Banners.article,
      href: "/news/1",
    },
    {
      id: "2",
      date: "២៥ មករា ២០២៥",
      title:
        "ពិធីចុះហត្ថលេខាលើអនុស្សរណៈសហការរវាង Lee Dong Sup ប្រធានក្រុម",
      description:
        "Lee Dong Sup បានចូលរួមក្នុងពិធីចុះហត្ថលេខាលើអនុស្សរណៈសហការជាមួយភាគីពាក់ព័ន្ធ ដើម្បីអភិវឌ្ឍវិស័យកីឡា...",
      image: Banners.article,
      href: "/news/1",
    },
    {
      id: "3",
      date: "២៥ មករា ២០២៥",
      title:
        "ពិធីចុះហត្ថលេខាលើអនុស្សរណៈសហការរវាង Lee Dong Sup ប្រធានក្រុម",
      description:
        "Lee Dong Sup បានចូលរួមក្នុងពិធីចុះហត្ថលេខាលើអនុស្សរណៈសហការជាមួយភាគីពាក់ព័ន្ធ ដើម្បីអភិវឌ្ឍវិស័យកីឡា...",
      image: Banners.article,
      href: "/news/1",
    }
  ]

  return (
    <div className="mt-16 container mx-auto max-w-6xl flex flex-col gap-3">
      <div>
        <div className="mt-8 flex-row inline-flex bg-gray-100 backdrop-blur-md rounded-full px-2 py-1 mr-2 -ml-2">
          <Button className="flex items-center gap-2 cursor-pointer group" onPress={() => router.push('/')}>
            <Typography variant="body4" className="group-hover:text-[#349FD8] group-hover:underline leading-[1.55]">
              ទំព័រដើម
            </Typography>
          </Button>
          <Typography variant="body4" className="leading-[1.55] mx-1">
            /
          </Typography>
          <Typography variant="body4" className="leading-[1.55]">
            បណ្ណាល័យ
          </Typography>
          <Typography variant="body4" className="leading-[1.55] mx-1">
            /
          </Typography>
          <Typography variant="body4" className="leading-[1.55] font-semibold">
            លម្អិត
          </Typography>
        </div>
      </div>

      <Typography variant="body2" className="leading-[1.55]">
        អង្គារ, 08 មីនា 2026
      </Typography>

      <Typography variant="h1" className="leading-[1.55]">
        ជួបសំណេះសំណាលនិងប្រគល់គ្រឿងសរសើរ ឧបនាយកសាលា Lee Dong Sup ប្រទេសកូរ៉េ
      </Typography>

      <Typography variant="body2" className="leading-[1.55]">
        យើងឧស្សាហ៍ប្រឹងប្រែងលើការលើកកម្ពស់កីឡាករខ្មែរឲ្យមានកិត្តិយស និងមោទនភាពក្នុងការតំណាងប្រទេសកម្ពុជា ទាំងនៅក្នុងប្រទេស និងអន្តរជាតិ។
      </Typography>

      <Image
        alt="banner"
        src={Banners.subBanner1}
        className="w-full object-cover rounded-2xl"
      />

      <Typography variant="body2" className="leading-[1.55]">
        ព្រឹត្ដិការណ៍ប្រកួតកីឡាតេក្វាន់ដូ អាយធី អេហ្វ (ITF) ជ្រើសរើសជើងឯកអាស៊ីអាគ្នេយ៍ លើកទី២ ឆ្នាំ២០២៥ បានបញ្ចប់ហើយ នៅល្ងាចថ្ងៃទី៣០ ខែមិថុនា។ កម្ពុជាដែលជាម្ចាស់ផ្ទះកម្ពុជា ក្ដាប់បានឱកាសឈរនៅលេខរៀងលើគេបង្អស់ដោយដណ្ដើមបានមេដាយសរុប ៩០គ្រឿង ក្នុងនោះមេដាយមាសទទួលបាន ៤៨គ្រឿង ប្រាក់ ៣៦គ្រឿង និងសំរិទ្ធ ៦គ្រឿង។
      </Typography>

      <Typography variant="body2" className="leading-[1.55]">
        លទ្ធផលជ័យជម្នះបានតាមពីក្រោយដោយប្រទេស ម៉ាឡេស៊ី ទទួលបានមេដាយសរុប ៥០គ្រឿង ក្នុងនោះ មេដាយមាស ១១គ្រឿង ប្រាក់ ១១គ្រឿង និងសំរឹទ្ធ ២២គ្រឿង។ បន្ទាប់មក គឺប្រទេសវៀតណាម ដណ្ដើមបានមេដាយមាសចនួន ២គ្រឿង ប្រាក់ ៥ និងសំរឹទ្ធ ២៥គ្រឿង។
      </Typography>

      <Image
        alt="banner"
        src={Banners.subBanner2}
        className="w-full object-cover rounded-2xl"
      />

      <Typography variant="body2" className="leading-[1.55]">
        ក្នុងចំណោមប្រទេសទាំង ៦ ដែលបានបញ្ជូនប្រតិភូ និងអត្ដពលិកប្រមាណ ២០០នាក់ បានទទួលជ័យជម្នះតាមពីក្រោយគ្នា គឺហ្វីលីពីន សិង្ហបុរី និងតាមពីក្រោយគេបង្អស់ដោយប្រទេសឥណ្ឌូណេស៊ី។ ពិធីប្រកាស និងបំពាក់មេដាយដល់ម្ចាស់ជួលាភី ត្រូវបានធ្វើឡើងក្រោមអធិបតីភាពឯកឧត្ដម កែវ រ៉េមី ប្រធានសហព័ន្ធកីឡាតេក្វាន់ដូ ITF កម្ពុជា ឯកឧត្ដម ថោង ខុន ប្រធានគណៈកម្មាធិការជាតិអូឡាំពិកកម្ពុជា (NOCC) ព្រមទាំងលោក Ri Yong Son ប្រធានសហព័ន្ធកីឡាតេក្វាន់ដូ ITF អន្ដរជាតិ។
      </Typography>

      <Spacer y={32} />

      <SectionHeader title="ព័ត៌មានផ្សេងៗទៀត">
        <div className="grid grid-cols-1 gap-10 lg:grid-cols-3">
          {articles.map((article) => (
            <ArticleCard
              key={article.id}
              article={article}
            />
          ))}
        </div>

        <div className="flex justify-center mt-16">
          <Button className="flex bg-[#121212] text-white py-2 px-3.5 rounded-full align-middle">
            <Typography variant="body2">ព័ត៌មានច្រើនទៀត</Typography>
          </Button>
        </div>
      </SectionHeader>
    </div>
  )
}
